docs: change diagrams to mermaid format
